benchmarks/results/20260804-153317/inline-c10.txt
Running 10s test @ http://127.0.0.1:8080/
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.16ms    3.38ms  57.73ms   92.86%
    Req/Sec     7.39k     3.05k   14.82k    62.75%
  Latency Distribution
     50%  159.00us
     75%  388.00us
     90%    2.64ms
     99%   17.68ms
  295185 requests in 10.09s, 35.19MB read
Requests/sec:  29253.81
Transfer/sec:      3.49MB