benchmarks/results/20260804-153317/small-file-warmup.txt
Running 2s test @ http://127.0.0.1:8080/hello.txt
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.69ms    6.73ms  48.24ms   97.78%
    Req/Sec   225.90     30.00   300.00     75.00%
  450 requests in 2.00s, 172.10KB read
Requests/sec:    224.65
Transfer/sec:     85.92KB